HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/wifi-mw-core/lwip-whd-port/cy_lwip_dhcp_server.c
    /* Calculate the first available IP address which will be served - based on the netmask and the local IP */
    ip_mask = ~(GET_IPV4_ADDRESS(netmask));
    subnet = GET_IPV4_ADDRESS(local_ip_address) & GET_IPV4_ADDRESS(netmask);
    next_available_ip_addr = subnet | ((GET_IPV4_ADDRESS(local_ip_address) + 1) & ip_mask);

    /* Prepare the Web proxy auto discovery URL */
    memcpy(&wpad_option_buff[2], WPAD_SAMPLE_URL, sizeof(WPAD_SAMPLE_URL)-1);
    ipv4_to_string( (char*)&wpad_option_buff[2 + 7], *server_ip_addr_ptr);

    /* Loop endlessly */
    while ( server->quit == false )
    {
        uint16_t       data_length = 0;
        uint16_t       available_data_length = 0;
        dhcp_header_t  *request_header;

        /* Sleep until data is received from socket. */
        if (udp_receive(&server->socket, &received_packet, WAIT_FOREVER) != CY_RSLT_SUCCESS)
        {
            continue;
        }

        /* Get a pointer to the data in the packet */
        packet_get_data(received_packet, 0, (uint8_t**) &request_header, &data_length, &available_data_length);

        if (data_length != available_data_length)
        {
            /* We don't support fragmented packets */
            packet_delete(received_packet);
            continue;
        }

        /* Check if received data length is at least the size of  dhcp_header_t. */
        /* Options field in DHCP header is variable length. We are looking for option "DHCP Message Type" that is 3 octets in size (code, length and type) */
        if (data_length < (sizeof(dhcp_header_t) - sizeof(request_header->options) + 3))
        {
            packet_delete(received_packet);
            continue;
        }

        /* Check if the option in the dhcp header is "DHCP Message Type", code value for option "DHCP Message Type" is 53 as per rfc2132 */
        if (request_header->options[0] != DHCP_MESSAGETYPE_OPTION_CODE)
        {
            packet_delete(received_packet);
            continue;
        }

        /* Check DHCP command */
        switch (request_header->options[2])
        {
            case DHCPDISCOVER:
            {
                dhcp_header_t           *reply_header   = NULL;
                uint16_t                available_space = 0;
                cy_lwip_mac_addr_t      client_mac_address;
                cy_lwip_ip_address_t    client_ip_address;
                uint32_t                temp;

                /* Create reply packet */
                if (packet_create_udp(&transmit_packet, (uint8_t**) &reply_header, &available_space) != CY_RSLT_SUCCESS)
                {
                    /* Cannot reply - release incoming packet */
                    packet_delete( received_packet );
                    break;
                }

                /* Copy in the DHCP header content from the received discover packet into the reply packet */
                memcpy(reply_header, request_header, sizeof(dhcp_header_t) - sizeof(reply_header->options));

                /* Finished with the received discover packet - release it */
                packet_delete(received_packet);

                /* Now construct the OFFER response */
                reply_header->opcode = BOOTP_OP_REPLY;

                /* Clear the DHCP options list */
                memset( &reply_header->options, 0, sizeof( reply_header->options ) );

                /* Record client MAC address */
                memcpy( &client_mac_address, request_header->client_hardware_addr, sizeof( client_mac_address ) );

                /* Check whether device is already cached */
                if (!get_client_ip_address_from_cache( &client_mac_address, &client_ip_address ))
                {
                    /* Address not found in cache. Use next available IP address */
                    client_ip_address.version = CY_LWIP_IP_VER_V4;
                    client_ip_address.ip.v4   = next_available_ip_addr;
                }

                /* Create the IP address for the Offer */
                temp = htonl(client_ip_address.ip.v4);
                memcpy(reply_header->your_ip_addr, &temp, sizeof(temp));

                /* Copy the magic DHCP number */
                memcpy(reply_header->magic, dhcp_magic_cookie, 4);

                /* Add options */
                option_ptr     = (char *) &reply_header->options;
                option_ptr     = MEMCAT( option_ptr, dhcp_offer_option_buff, 3 );                                   /* DHCP message type            */
                option_ptr     = MEMCAT( option_ptr, server_ip_addr_option_buff, 6 );                               /* Server identifier            */
                option_ptr     = MEMCAT( option_ptr, lease_time_option_buff, 6 );                                   /* Lease Time                   */
                option_ptr     = MEMCAT( option_ptr, subnet_mask_option_buff, 6 );                                  /* Subnet Mask                  */
                option_ptr     = (char*)MEMCAT( option_ptr, wpad_option_buff, sizeof(wpad_option_buff) );           /* Web proxy auto discovery URL */
                /* Copy the local IP into the Router & DNS server Options */
                memcpy( option_ptr, server_ip_addr_option_buff, 6 );                                                /* Router (gateway)             */
                option_ptr[0]  = 3;                                                                                 /* Router id                    */
                option_ptr    += 6;
                memcpy( option_ptr, server_ip_addr_option_buff, 6 );                                                /* DNS server                   */
                option_ptr[0]  = 6;                                                                                 /* DNS server id                */
                option_ptr    += 6;
                option_ptr     = MEMCAT( option_ptr, mtu_option_buff, 4 );                                          /* Interface MTU                */
                option_ptr[0]  = (char) DHCP_END_OPTION_CODE;                                                       /* end options                  */
                option_ptr++;

                /* Send OFFER reply packet */
                packet_set_data_end(transmit_packet, (uint8_t*) option_ptr);
                if (cy_udp_send(&server->socket, &broadcast_addr, IPPORT_DHCPC, transmit_packet) != CY_RSLT_SUCCESS)
                {
                    packet_delete(transmit_packet);
                }
            }
            break;

            case DHCPREQUEST:
            {
                /* REQUEST command - send back ACK or NAK */
                uint32_t                temp;
                uint32_t                *server_id_req;
                dhcp_header_t           *reply_header;
                uint16_t                available_space;
                cy_lwip_mac_addr_t      client_mac_address;
                cy_lwip_ip_address_t    given_ip_address;
                cy_lwip_ip_address_t    requested_ip_address;
                bool                    next_avail_ip_address_used = false;

