HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/wifi-mw-core/lwip-whd-port/cy_lwip_dhcp_server.c
                /* Check that the REQUEST is for this server */
                server_id_req = (uint32_t*) find_option( request_header, DHCP_SERVER_IDENTIFIER_OPTION_CODE );
                if ( ( server_id_req != NULL ) && ( GET_IPV4_ADDRESS( local_ip_address ) != htobe32(*server_id_req) ) )
                {
                    break; /* Server ID does not match local IP address */
                }

                /* Create reply packet */
                if ( packet_create_udp(&transmit_packet, (uint8_t**) &reply_header, &available_space ) != CY_RSLT_SUCCESS )
                {
                    /* Cannot reply - release incoming packet */
                    packet_delete( received_packet );
                    break;
                }

                /* Copy in the DHCP header content from the received request packet into the reply packet */
                memcpy( reply_header, request_header, sizeof(dhcp_header_t) - sizeof(reply_header->options) );

                /* Record client MAC address */
                memcpy( &client_mac_address, request_header->client_hardware_addr, sizeof( client_mac_address ) );

                /* Locate the requested address in the options and keep requested address */
                requested_ip_address.version = CY_LWIP_IP_VER_V4;
                requested_ip_address.ip.v4   = ntohl(*(uint32_t*)find_option( request_header, DHCP_REQUESTED_IP_ADDRESS_OPTION_CODE ));

                /* Delete received packet. We don't need it anymore */
                packet_delete( received_packet );

                reply_header->opcode = BOOTP_OP_REPLY;

                /* Blank options list */
                memset( &reply_header->options, 0, sizeof( reply_header->options ) );

                /* Copy DHCP magic number into packet */
                memcpy( reply_header->magic, dhcp_magic_cookie, 4 );

                option_ptr = (char *) &reply_header->options;

                /* Check if device is cache. If it is, give the previous IP address. Otherwise give the next available IP address */
                if ( !get_client_ip_address_from_cache( &client_mac_address, &given_ip_address ) )
                {
                    /* Address not found in cache. Use next available IP address */
                    next_avail_ip_address_used = true;
                    given_ip_address.version   = CY_LWIP_IP_VER_V4;
                    given_ip_address.ip.v4     = next_available_ip_addr;
                }

                /* Check if the requested IP address matches one we have assigned */
                if ( memcmp( &requested_ip_address.ip.v4, &given_ip_address.ip.v4, sizeof( requested_ip_address.ip.v4 ) ) != 0 )
                {
                    /* Request is not for the assigned IP - force client to take next available IP by sending NAK */
                    /* Add appropriate options */
                    option_ptr = (char*)MEMCAT( option_ptr, dhcp_nak_option_buff, 3 );             /* DHCP message type */
                    option_ptr = (char*)MEMCAT( option_ptr, server_ip_addr_option_buff, 6 );       /* Server identifier */
                    memset( reply_header->your_ip_addr, 0, sizeof( reply_header->your_ip_addr ) ); /* Clear IP addr     */
                }
                else
                {
                    /* Request is for next available IP */
                    /* Add appropriate options */
                    option_ptr     = (char*)MEMCAT( option_ptr, dhcp_ack_option_buff, 3 );                              /* DHCP message type            */
                    option_ptr     = (char*)MEMCAT( option_ptr, server_ip_addr_option_buff, 6 );                        /* Server identifier            */
                    option_ptr     = (char*)MEMCAT( option_ptr, lease_time_option_buff, 6 );                            /* Lease Time                   */
                    option_ptr     = (char*)MEMCAT( option_ptr, subnet_mask_option_buff, 6 );                           /* Subnet Mask                  */
                    option_ptr     = (char*)MEMCAT( option_ptr, wpad_option_buff, sizeof(wpad_option_buff) );           /* Web proxy auto discovery URL */
                    /* Copy the local IP into the Router & DNS server Options */
                    memcpy( option_ptr, server_ip_addr_option_buff, 6 );                                                /* Router (gateway)             */
                    option_ptr[0]  = 3;                                                                                 /* Router id                    */
                    option_ptr    += 6;
                    memcpy( option_ptr, server_ip_addr_option_buff, 6 );                                                /* DNS server                   */
                    option_ptr[0]  = 6;                                                                                 /* DNS server id                */
                    option_ptr    += 6;
                    option_ptr     = (char*)MEMCAT( option_ptr, mtu_option_buff, 4 );                                   /* Interface MTU                */

                    /* Create the IP address for the Offer */
                    temp = htonl(given_ip_address.ip.v4);
                    memcpy( reply_header->your_ip_addr, &temp, sizeof( temp ) );

                    /* Increment next available IP address only if not found in cache */
                    if ( next_avail_ip_address_used == true )
                    {
                        do
                        {
                            next_available_ip_addr = subnet | ( ( next_available_ip_addr + 1 ) & ip_mask );
                        } while ( next_available_ip_addr == GET_IPV4_ADDRESS(local_ip_address) );
                    }

                    /* Cache client */
                    add_client_to_cache( &client_mac_address, &given_ip_address );
                }

                option_ptr[0] = (char) DHCP_END_OPTION_CODE; /* end options */
                option_ptr++;

                /* Send reply packet */
                packet_set_data_end( transmit_packet, (uint8_t*) option_ptr );
                if (cy_udp_send( &server->socket, &broadcast_addr, IPPORT_DHCPC, transmit_packet ) != CY_RSLT_SUCCESS)
                {
                    packet_delete( transmit_packet );
                }
            }
            break;

            default:
                /* Unknown packet type - release received packet */
                packet_delete( received_packet );
            break;
        }
    }
    cy_rtos_exit_thread();
}

/**
 *  Finds a specified DHCP option
 *
 *  Searches the given DHCP request and returns a pointer to the
 *  specified DHCP option data, or NULL if not found
 *
 * @param[out] request    : The DHCP request structure
 * @param[in]  option_num : Which DHCP option number to find
 *
 * @return Pointer to the DHCP option data, or NULL if not found
 */
static const uint8_t* find_option( const dhcp_header_t* request, uint8_t option_num )
{
    const uint8_t* option_ptr = request->options;
    while ( ( option_ptr[0] != DHCP_END_OPTION_CODE ) &&                               /* Check for end-of-options flag */
            ( option_ptr[0] != option_num ) &&                                         /* Check for matching option number */
            ( option_ptr < ( (const uint8_t*) request ) + sizeof( dhcp_header_t ) ) )  /* Check for buffer overrun */
    {
        option_ptr += option_ptr[1] + 2;
    }

    /* Was the option found? */
    if ( option_ptr[0] == option_num )
    {
        return &option_ptr[2];
    }
    return NULL;
}

/**
 *  Searches the cache for a given MAC address to find a matching IP address
 *
 * @param[in]  client_mac_address : MAC address to search for
 * @param[out] client_ip_address  : Receives any IP address which is found
 *
 * @return true if found, false otherwise
 */
static bool get_client_ip_address_from_cache( const cy_lwip_mac_addr_t* client_mac_address, cy_lwip_ip_address_t* client_ip_address )
{
    uint32_t a;

    /* Check whether device is already cached */
    for ( a = 0; a < DHCP_IP_ADDRESS_CACHE_MAX; a++ )
    {
        if ( memcmp( &cached_mac_addresses[ a ], client_mac_address, sizeof( *client_mac_address ) ) == 0 )
        {
            *client_ip_address = cached_ip_addresses[ a ];
            return true;
        }
    }

