HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/wifi-mw-core/lwip-whd-port/cy_lwip_dhcp_server.c
    return false;
}

/**
 *  Adds the MAC & IP addresses of a client to the cache
 *
 * @param[in] client_mac_address : MAC address of the client to store
 * @param[in] client_ip_address  : IP address of the client to store
 *
 * @return CY_RSLT_SUCCESS
 */
static cy_rslt_t add_client_to_cache( const cy_lwip_mac_addr_t* client_mac_address, const cy_lwip_ip_address_t* client_ip_address )
{
    uint32_t a;
    uint32_t first_empty_slot;
    uint32_t cached_slot;

    /* Search for empty slot in cache */
    for ( a = 0, first_empty_slot = DHCP_IP_ADDRESS_CACHE_MAX, cached_slot = DHCP_IP_ADDRESS_CACHE_MAX; a < DHCP_IP_ADDRESS_CACHE_MAX; a++ )
    {
        /* Check for matching MAC address */
        if ( memcmp( &cached_mac_addresses[ a ], client_mac_address, sizeof( *client_mac_address ) ) == 0 )
        {
            /* Cached device found */
            cached_slot = a;
            break;
        }
        else if ( first_empty_slot == DHCP_IP_ADDRESS_CACHE_MAX && memcmp( &cached_mac_addresses[ a ], &empty_cache, sizeof(cy_lwip_mac_addr_t) ) == 0 )
        {
            /* Device not found in cache. Return the first empty slot */
            first_empty_slot = a;
        }
    }

    if ( cached_slot != DHCP_IP_ADDRESS_CACHE_MAX )
    {
        /* Update IP address of cached device */
        cached_ip_addresses[cached_slot] = *client_ip_address;
    }
    else if ( first_empty_slot != DHCP_IP_ADDRESS_CACHE_MAX )
    {
        /* Add device to the first empty slot */
        cached_mac_addresses[ first_empty_slot ] = *client_mac_address;
        cached_ip_addresses [ first_empty_slot ] = *client_ip_address;
    }
    else
    {
        /* Cache is full. Add device to slot 0 */
        cached_mac_addresses[ 0 ] = *client_mac_address;
        cached_ip_addresses [ 0 ] = *client_ip_address;
    }

    return CY_RSLT_SUCCESS;
}

/**
 * Converts a unsigned 32-bit long int to a decimal string
 *
 * @param value[in]      : The unsigned long to be converted.
 * @param output[out]    : The buffer which will receive the decimal string. A terminating 'null' is added. Ensure that there is space in the buffer for this.
 * @param min_length[in] : The minimum number of characters to output (zero padding will apply if required).
 * @param max_length[in] : The maximum number of characters to output. The max number of characters it can have is of the length of (ULONG_MAX + 1).
 *
 * @return the number of characters returned (excluding terminating null)
 *
 */
uint8_t unsigned_to_decimal_string( uint32_t value, char* output, uint8_t min_length, uint8_t max_length )
{
    uint8_t digits_left;
    char buffer[sizeof(ULONG_MAX_STR) + 1] = ULONG_MIN_STR; /* Buffer for storing ULONG_MAX with +1 for the sign */

    if ( output == NULL )
    {
        return 0;
    }

    max_length = (uint8_t) MIN( max_length, sizeof( buffer ) );
    digits_left = max_length;
    do
    {
        --digits_left;
        buffer[ digits_left ] = (char) (( value % 10 ) + '0');
        value = value / 10;
    } while ( ( value != 0 ) && ( digits_left != 0 ) );

    digits_left = (uint8_t) MIN( ( max_length - min_length ), digits_left );
    memcpy( output, &buffer[ digits_left ], (size_t)( max_length - digits_left ) );

    /* Add terminating null */
    output[( max_length - digits_left )] = '\x00';

    return (uint8_t) ( max_length - digits_left );
}


/**
 *  Convert a IPv4 address to a string
 *
 *  @note: String is 16 bytes including terminating null
 *
 * @param[out] buffer       : Buffer which will recieve the IPv4 string
 * @param[in]  ipv4_address : IPv4 address to convert
 */
static void ipv4_to_string( char buffer[16], uint32_t ipv4_address )
{
    uint8_t* ip = (uint8_t*)&ipv4_address;
    unsigned_to_decimal_string(ip[0], &buffer[0], 3, 3);
    buffer[3] = '.';
    unsigned_to_decimal_string(ip[1], &buffer[4], 3, 3);
    buffer[7] = '.';
    unsigned_to_decimal_string(ip[2], &buffer[8], 3, 3);
    buffer[11] = '.';
    unsigned_to_decimal_string(ip[3], &buffer[12], 3, 3);
}


static cy_rslt_t udp_create_socket(cy_lwip_udp_socket_t *socket, uint16_t port, cy_lwip_nw_interface_role_t interface)
{
    err_t status;

    memset( socket, 0, sizeof(cy_lwip_udp_socket_t) );
    socket->conn_handler = netconn_new( NETCONN_UDP );
    if( socket->conn_handler == NULL )
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to create UDP socket \n");
        return CY_RSLT_LWIP_SOCKET_CREATE_FAIL;
    }

    /* Bind it to designated port and IP */
    status = netconn_bind( socket->conn_handler, IP_ANY_TYPE, port );
    if( status != ERR_OK )
    {
        netconn_delete( socket->conn_handler );
        socket->conn_handler = NULL;
        return CY_RSLT_LWIP_SOCKET_ERROR;
    }
    socket->is_bound  = true;
    socket->role = interface;

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t udp_delete_socket(cy_lwip_udp_socket_t *socket)
{
    if (socket->conn_handler == NULL)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error : Socket deletion failed due to invalid socket \n");
        return CY_RSLT_LWIP_INVALID_SOCKET;
    }
    /* Note: No need to check return value of netconn_delete. It only ever returns ERR_OK */
    netconn_delete(socket->conn_handler);
    socket->conn_handler = NULL;
    return CY_RSLT_SUCCESS;
}

static cy_rslt_t udp_receive(cy_lwip_udp_socket_t *socket, cy_lwip_packet_t** packet, uint32_t timeout)
{
    err_t status;

    if (socket->conn_handler == NULL)
    {
        return CY_RSLT_LWIP_SOCKET_ERROR;
    }

    netconn_set_recvtimeout(socket->conn_handler, (int)timeout);
    status = netconn_recv(socket->conn_handler, packet);
    if ( status != ERR_OK )
    {
        return CY_RSLT_LWIP_SOCKET_ERROR;
    }

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t packet_get_data(cy_lwip_packet_t *packet, uint16_t offset, uint8_t** data, uint16_t* fragment_available_data_length, uint16_t *total_available_data_length)
{
    s8_t get_next_result;

    netbuf_first( packet );
    *total_available_data_length = (uint16_t)( netbuf_len(packet) - offset );

    do
    {
        uint16_t frag_size = packet->ptr->len;
        *data        = packet->ptr->payload;

        if ( frag_size == 0 && *total_available_data_length == 0 )
        {
            *data                           = NULL;
            *fragment_available_data_length = 0;
            *total_available_data_length    = 0;
            return CY_RSLT_SUCCESS;
        }
        else if ( offset < frag_size )
        {
            *data += offset;
            *fragment_available_data_length = (uint16_t)(frag_size - offset);
            return CY_RSLT_SUCCESS;
        }
        else
        {
            offset = (uint16_t)(offset - frag_size);
            get_next_result = netbuf_next( packet );
        }
    } while ( get_next_result != -1 );

    return CY_RSLT_LWIP_CORRUPT_BUFFER;
}

static cy_rslt_t packet_set_data_end(cy_lwip_packet_t *packet, uint8_t* data_end)
{
    packet->ptr->len     = (uint16_t) ( data_end - ( (uint8_t*) packet->ptr->payload ) );
    packet->p->tot_len = packet->p->len;

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t packet_delete(cy_lwip_packet_t* packet)
{
    netbuf_delete( packet );
    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_udp_send(cy_lwip_udp_socket_t* socket, const cy_lwip_ip_address_t* address, uint16_t port, cy_lwip_packet_t* packet)
{
    ip_addr_t temp;
    err_t status;
    cy_rslt_t result;

    if((socket == NULL) || (address == NULL) || (packet == NULL))
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }

    /* Associate UDP socket with specific remote IP address and a port */
    cy_ip_to_lwip(&temp, address);
    status = netconn_connect(socket->conn_handler, &temp, port);
    if ( status != ERR_OK )
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket error unable to associate socket with IP address \n");
        return CY_RSLT_LWIP_SOCKET_ERROR;
    }

    /* Total length and a length must be equal for a packet to be valid */
    packet->p->len = packet->p->tot_len;

