HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/wifi-mw-core/lwip-whd-port/cy_lwip_dhcp_server.c
    /* Send the packet via UDP socket */
    result = internal_udp_send(socket->conn_handler, packet, (cy_lwip_nw_interface_role_t)socket->role);
    if ( result != CY_RSLT_SUCCESS )
    {
        netconn_disconnect(socket->conn_handler);
        return result;
    }

    netbuf_delete( packet );

    /* Return back to disconnected state
     * Note: We are ignoring the return for this as we MUST return CY_RSLT_SUCCESS otherwise the caller may attempt to
     * free the packet a second time.
     */
    netconn_disconnect(socket->conn_handler);
    return CY_RSLT_SUCCESS;
}

void cy_ip_to_lwip(ip_addr_t *dest, const cy_lwip_ip_address_t *src)
{
    if(src->version == CY_LWIP_IP_VER_V4)
    {
        ip_addr_set_ip4_u32(dest, htonl(GET_IPV4_ADDRESS(*src)));
    }
}

static cy_rslt_t internal_udp_send(struct netconn* handler, cy_lwip_packet_t* packet, cy_lwip_nw_interface_role_t interface)
{
    err_t status;
    if(cy_rtos_get_mutex(&dhcp_mutex, CY_DHCP_MAX_MUTEX_WAIT_TIME_MS) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_LWIP_DHCP_WAIT_TIMEOUT;
    }

    /* Bind interface to the socket. */
    udp_bind_netif(handler->pcb.udp, cy_lwip_get_interface(interface));

    /* send a packet */
    packet->p->len = packet->p->tot_len;
    status = netconn_send( handler, packet );
    if (cy_rtos_set_mutex(&dhcp_mutex) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_LWIP_DHCP_MUTEX_ERROR;
    }
    netbuf_free(packet);
    return ((status == CY_RSLT_SUCCESS) ? CY_RSLT_SUCCESS : CY_RSLT_LWIP_SOCKET_ERROR);
}

static cy_rslt_t packet_create_udp(cy_lwip_packet_t** packet, uint8_t** data, uint16_t* available_space )
{
    return internal_packet_create(packet, MAX_UDP_PAYLOAD_SIZE, data, available_space);
}

static cy_rslt_t internal_packet_create( cy_lwip_packet_t** packet, uint16_t content_length, uint8_t** data, uint16_t* available_space )
{
    int i = 0;

    for (i = 0; i < ALLOCATE_PACKET_TIMEOUT; ++i)
    {
        *packet = netbuf_new();
        if (*packet != NULL)
        {
            *data = netbuf_alloc(*packet, content_length);
            if (*data != NULL)
            {
                *available_space = content_length;
                return CY_RSLT_SUCCESS;
            }
            netbuf_delete(*packet);
            *packet = NULL;
            *available_space = 0;
        }
        cy_rtos_delay_milliseconds(1);
    }

    *available_space = 0;
    return CY_RSLT_LWIP_DHCP_TIMEOUT;
}
#endif //LWIP_IPV4
